# 1st program

""" Напишите в начале программы однострочный комментарий: "1st program".
Выведите на экран(в консоль) результат: возведение числа 9 в степень 0.5, после умножение на 5.
Предполагаемый результат: 15.0
"""


def solution() -> float:
    return 9 ** 0.5 * 5


def main():
    print(solution())


if __name__ == '__main__':
    main()
